arduino/Arduino/hardware/msp430/libraries/Wire/utility/twi.c
/* 
 * Function twi_releaseBus
 * Desc     releases bus control
 * Input    none
 * Output   none
 */
void twi_releaseBus(void)
{

}

#if 0
//__attribute__((interrupt(USI_VECTOR)))
void USI_ISR(void)
{
	switch(twi_state){
	// All Master
	case TWI_SND_START:// sent start condition
		USISRL = 0x00;                // Generate Start Condition...
		USICTL0 |= USIGE+USIOE;
		USICTL0 &= ~USIGE;
		USISRL = twi_slarw;
		USICNT = (USICNT & 0xE0) + 0x08;
		twi_state = TWI_RECV_SLA_ACK;

		break;
	case TWI_RECV_SLA_ACK: // reveive (N)ACK

		USICTL0 &= ~USIOE; // SDA = input
		USICNT |= 0x01; // Bit counter=1
		twi_state = TWI_PROC_SLA_ACK;
		break;
	case TWI_PROC_SLA_ACK:
		if ((USISRL & 0x01) || (twi_masterBufferIndex == twi_masterBufferLength)){
			if(twi_masterBufferIndex == 0) {
				//we haven't advance so must be an address NACK
				twi_error = TWI_ERROR_ADDR_NACK;
			} else if (twi_masterBufferIndex < twi_masterBufferLength){
				twi_error = TWI_ERROR_DATA_NACK;
			}
			twi_stop();
			twi_state = TWI_EXIT;
		} else { // ACK received
			USICTL0 |= USIOE;
			USISRL = twi_masterBuffer[twi_masterBufferIndex++];
			USICNT |=  0x08;
			twi_state = TWI_RECV_SLA_ACK;
		}
		// if receive data set counter to 8 and SDA to in
		// then go to receive data processing stage

		break;
	//case TWI_PROC_SLA_DATA:
	//	if not the last byte,
	case TWI_EXIT:
		USISRL = 0x0FF; // USISRL = 1 to drive SDA high
		USICTL0 |= USIGE; // Transparent latch enabled
		USICTL0 &= ~(USIGE+USIOE); // Latch/SDA output disabled
		twi_state = TWI_IDLE; //Idle
		break;
	}

	USICTL1 &= ~USIIFG; // !!!Clear pending flag!!!

}
#endif

void send_start()
{
#ifdef __MSP430_HAS_USI__
	USISRL = 0x00;                // Generate Start Condition...
	USICTL0 |= USIGE+USIOE;
	USICTL0 &= ~USIGE;
	USISRL = twi_slarw;
	USICNT = (USICNT & 0xE0) + 0x08;
#endif
#ifdef __MSP430_HAS_USCI__
#endif
#ifdef __MSP430_HAS_EUSCI_B0__
#endif
}

#ifdef __MSP430_HAS_USI__
__attribute__((interrupt(USI_VECTOR)))
void USI_ISR(void)
{
	switch(twi_state){

	// Master transmit / receive
	case TWI_SND_START:
		send_start();
		twi_state = TWI_PREP_SLA_ADDR_ACK;
		break;
	case TWI_PREP_SLA_ADDR_ACK: // reveive (N)ACK
		USICTL0 &= ~USIOE; // SDA = input
		USICNT |= 0x01; // Bit counter=1
		twi_state = TWI_MT_PROC_ADDR_ACK;
		break;
	case TWI_MT_PROC_ADDR_ACK:
		if (USISRL & 0x01) {
			twi_error = TWI_ERROR_ADDR_NACK;
			twi_stop();
			twi_state = TWI_EXIT;
			break;
		}
		if(twi_slarw & 1)
			goto mtre;
		else
			goto mtpd;
		// else fall through and process data ACK;
	case TWI_MT_PREP_DATA_ACK: // reveive (N)ACK
		USICTL0 &= ~USIOE; // SDA = input
		USICNT |= 0x01; // Bit counter=1
		twi_state = TWI_MT_PROC_DATA_ACK;
		break;
	case TWI_MT_PROC_DATA_ACK:
mtpd:
		if (USISRL & 0x01) {
			twi_error = TWI_ERROR_DATA_NACK;
			twi_stop();
			twi_state = TWI_EXIT;
			break;
		}

		if(twi_masterBufferIndex == twi_masterBufferLength) {
			twi_stop();
			twi_state = TWI_EXIT;
			break;
		}

		USICTL0 |= USIOE;
		USISRL = twi_masterBuffer[twi_masterBufferIndex++];
		USICNT |=  0x08;
		twi_state = TWI_MT_PREP_DATA_ACK;
		break;
	// Master receiver
mtre:
	case TWI_MR_PREP_DATA_RECV:
		USICTL0 &= ~USIOE; // SDA input
		USICNT |=  0x08; // Bit counter = 8, RX data
		twi_state = TWI_MR_PROC_DATA_RECV;
		break;
	case TWI_MR_PROC_DATA_RECV:
		USICTL0 |= USIOE; // SDA output
		twi_masterBuffer[twi_masterBufferIndex++] = USISRL;
		if(twi_masterBufferIndex > twi_masterBufferLength ) {
			USISRL = 0xFF; // that was the last byte send NACK
			twi_state = TWI_MR_PREP_STOP;
		} else {
			USISRL = 0x00; // keep on receiving and send ACK
			twi_state = TWI_MR_PREP_DATA_RECV;
		}
		USICNT |= 0x01;
		break;
	case TWI_MR_PREP_STOP:
		twi_stop();
		twi_state = TWI_EXIT;
		break;
	// Slave receiver
	// Slave transmitter
	// All
	case TWI_EXIT:
		USISRL = 0x0FF; // USISRL = 1 to drive SDA high
		USICTL0 |= USIGE; // Transparent latch enabled
		USICTL0 &= ~(USIGE+USIOE); // Latch/SDA output disabled
		twi_state = TWI_IDLE; //Idle
		break;

	default:
		break;//should not happen handle error
	}

	USICTL1 &= ~USIIFG; // !!!Clear pending flag!!!

}
#endif
#ifdef __MSP430_HAS_USCI__
__attribute__((interrupt(USCIAB0TX_VECTOR)))
void USCI_RX_TX_ISR(void)  // RX/TX Service
{
    if (UC0IE & UCA0RXIFG){               // USCI I2C Mode: UCRXIFG0
		if (twi_state ==  TWI_MRX) {      // Master receive mode
			twi_masterBuffer[twi_masterBufferIndex++] = UCB0RXBUF; // Get RX data
			if(twi_masterBufferIndex == twi_masterBufferLength ) 
				UCB0CTL1 |= UCTXSTP;     // Generate I2C stop condition
			if(twi_masterBufferIndex > twi_masterBufferLength ) {
				twi_state = TWI_IDLE;    //Idle
			} else {
			}
		} else {
			// if there is still room in the rx buffer
			if(twi_rxBufferIndex < TWI_BUFFER_LENGTH){
				// put byte in buffer and ack
				twi_rxBuffer[twi_rxBufferIndex++] = UCB0RXBUF;
			}else{
				// otherwise nack
				UCB0CTL1 |= UCTXNACK;   // Generate NACK condition
			}
		}
    }
    if (UC0IE & UCA0TXIFG){              // USCI I2C Mode: UCTXIFG0
		if (twi_state == TWI_MTX) {      // Master receive mode
			// if there is data to send, send it, otherwise stop 
			if(twi_masterBufferIndex < twi_masterBufferLength){
				// copy data to output register and ack
				UCB0TXBUF = twi_masterBuffer[twi_masterBufferIndex++];                 // Transmit data at address PTxData
			}else{
			   if (twi_sendStop)
				UCB0CTL1 |= UCTXSTP;     // Generate I2C stop condition
			   else {
				 twi_inRepStart = true;  // we're gonna send the START
				 // don't enable the interrupt. We'll generate the start, but we 
				 // avoid handling the interrupt until we're in the next transaction,
				 // at the point where we would normally issue the start.
				 UCB0CTL1 |= UCTXSTT;        
				 twi_state = TWI_IDLE;
			   }
               UC0IFG &= ~UCB0TXIFG;      // Clear USCI_B0 TX int flag
			}
		} else {
			// copy data to output register
			UCB0TXBUF = twi_txBuffer[twi_txBufferIndex++];
			// if there is more to send, ack, otherwise nack
			if(twi_txBufferIndex < twi_txBufferLength){
			}else{
				UCB0CTL1 |= UCTXNACK;    // Generate NACK condition
			}
		}
	}
}

